#ifndef PVZ_LAWN_BOARD_H
#define PVZ_LAWN_BOARD_H

#include "PvZ/Lawn/Common/ConstEnums.h"
#include "PvZ/TodLib/Common/DataArray.h"
#include "PvZ/SexyAppFramework/Widget/ButtonListener.h"
#include "PvZ/SexyAppFramework/Widget/Widget.h"
#include "PvZ/Symbols.h"
#include "PvZ/SexyAppFramework/Misc/KeyCodes.h"
#include "PvZ/Lawn/Widget/AchievementsWidget.h"

#include "Coin.h"
#include "GridItem.h"
#include "LawnMower.h"
#include "Plant.h"
#include "Projectile.h"
#include "Zombie.h"

constexpr int MAX_GRID_SIZE_X = 9;
constexpr int MAX_GRID_SIZE_Y = 6;
constexpr int MAX_ZOMBIES_IN_WAVE = 50;
constexpr int MAX_ZOMBIE_WAVES = 100;
constexpr int MAX_GRAVE_STONES = MAX_GRID_SIZE_X * MAX_GRID_SIZE_Y;
constexpr int MAX_POOL_GRID_SIZE = 10;
constexpr int MAX_RENDER_ITEMS = 2048;
constexpr int PROGRESS_METER_COUNTER = 150;

class LawnApp;
class CursorObject;
class CursorPreview;
class GameButton;
class MessageWidget;
class SeedBank;
class CutScene;
class Challenge;
class Reanimation;
class TodParticleSystem;
class GamepadControls;

class HitResult {
public:
    void *mObject;
    GameObjectType mObjectType;
};

struct ZombiePicker {
    int mZombieCount;
    int mZombiePoints;
    int mZombieTypeCount[ZombieType::NUM_ZOMBIE_TYPES];
    int mAllWavesZombieTypeCount[ZombieType::NUM_ZOMBIE_TYPES];
};

/*inline*/ void ZombiePickerInitForWave(ZombiePicker *theZombiePicker);
/*inline*/ void ZombiePickerInit(ZombiePicker *theZombiePicker);

struct PlantsOnLawn {
    Plant *mUnderPlant;
    Plant *mPumpkinPlant;
    Plant *mFlyingPlant;
    Plant *mNormalPlant;
};

struct BungeeDropGrid {
    TodWeightedGridArray mGridArray[MAX_GRID_SIZE_X * MAX_GRID_SIZE_Y];
    int mGridArrayCount;
};

struct PlantRbTree {
    int unk[6];
};

enum TouchState {
    TOUCHSTATE_NONE = 0,
    TOUCHSTATE_SEED_BANK = 1,
    TOUCHSTATE_SHOVEL_RECT = 2,
    TOUCHSTATE_BUTTER_RECT = 3,
    TOUCHSTATE_BOARD = 4,
    TOUCHSTATE_BOARD_MOVED_FROM_SEED_BANK = 5,
    TOUCHSTATE_BOARD_MOVED_FROM_SHOVEL_RECT = 6,
    TOUCHSTATE_BOARD_MOVED_FROM_BUTTER_RECT = 7,
    TOUCHSTATE_VALID_COBCONON = 8,
    TOUCHSTATE_USEFUL_SEED_PACKET = 9,
    TOUCHSTATE_UNUSED = 10,
    TOUCHSTATE_HEAVY_WEAPON = 11,
    TOUCHSTATE_PICKING_SOMETHING = 12,
    TOUCHSTATE_ZEN_GARDEN_TOOLS = 13,
    TOUCHSTATE_BOARD_MOVED_FROM_ZEN_GARDEN_TOOLS = 14,
    TOUCHSTATE_VALID_COBCONON_SECOND = 15,
};

enum TouchPlayerIndex {
    TOUCHPLAYER_NONE = -1,
    TOUCHPLAYER_PLAYER1 = 0,
    TOUCHPLAYER_PLAYER2 = 1
};

class Board : public Sexy::Widget {
public:
    Sexy::ButtonListener mButtonListener;       // 64
    int unknownMembers1[4];                     // 65 ~ 68
    LawnApp *mApp;                              // 69
    Zombie *mZombiesBlock;                      // 70
    unsigned int mZombiesMaxUsedCount;          // 71
    unsigned int mZombiesMaxSize;               // 72
    unsigned int mZombiesFreeListHead;          // 73
    unsigned int mZombiesSize;                  // 74
    unsigned int mZombiesNextKey;               // 75
    const char *mZombiesName;                   // 76
    Plant *mPlantsBlock;                        // 77
    unsigned int mPlantsMaxUsedCount;           // 78
    unsigned int mPlantsMaxSize;                // 79
    unsigned int mPlantsFreeListHead;           // 80
    unsigned int mPlantsSize;                   // 81
    unsigned int mPlantsNextKey;                // 82
    const char *mPlantsName;                    // 83
    Projectile *mProjectilesBlock;              // 84
    unsigned int mProjectilesMaxUsedCount;      // 85
    unsigned int mProjectilesMaxSize;           // 86
    unsigned int mProjectilesFreeListHead;      // 87
    unsigned int mProjectilesSize;              // 88
    unsigned int mProjectilesNextKey;           // 89
    const char *mProjectilesName;               // 90
    Coin *mCoinsBlock;                          // 91
    unsigned int mCoinsMaxUsedCount;            // 92
    unsigned int mCoinsMaxSize;                 // 93
    unsigned int mCoinsFreeListHead;            // 94
    unsigned int mCoinsSize;                    // 95
    unsigned int mCoinsNextKey;                 // 96
    const char *mCoinsName;                     // 97
    int *mLawnMowersBlock;                      // 98
    unsigned int mLawnMowersMaxUsedCount;       // 99
    unsigned int mLawnMowersMaxSize;            // 100
    unsigned int mLawnMowersFreeListHead;       // 101
    unsigned int mLawnMowersSize;               // 102
    unsigned int mLawnMowersNextKey;            // 103
    const char *mLawnMowersName;                // 104
    GridItem *mGridItemsBlock;                  // 105
    unsigned int mGridItemsMaxUsedCount;        // 106
    unsigned int mGridItemsMaxSize;             // 107
    unsigned int mGridItemsFreeListHead;        // 108
    unsigned int mGridItemsSize;                // 109
    unsigned int mGridItemsNextKey;             // 110
    const char *mGridItemsName;                 // 111
    PlantRbTree mTangleKelpTree;                // 112 ~ 117
    PlantRbTree mFlowerPotTree;                 // 118 ~ 123
    PlantRbTree mPumpkinTree;                   // 124 ~ 129
    MessageWidget *mAdvice;                     // 130
    SeedBank *mSeedBank1;                       // 131
    SeedBank *mSeedBank2;                       // 132
    int unknownMembers3[7];                     // 133 ~ 139
    GamepadControls *mGamepadControls1;         // 140
    GamepadControls *mGamepadControls2;         // 141
    CursorObject *mCursorObject1;               // 142
    CursorObject *mCursorObject2;               // 143
    CursorPreview *mCursorPreview1;             // 144
    CursorPreview *mCursorPreview2;             // 145
    int *mToolTipWidget;                        // 146
    int *mToolTipFont;                          // 147
    CutScene *mCutScene;                        // 148
    Challenge *mChallenge;                      // 149
    bool unknownBool;                           // 600
    bool mPaused;                               // 601
    GridSquareType mGridSquareType[9][6];       // 151 ~ 204
    int mGridCelLook[9][6];                     // 205 ~ 258
    int mGridCelOffset[9][6][2];                // 259 ~ 366
    int mGridCelFog[9][7];                      // 367 ~ 429
    bool mEnableGraveStones;                    // 1720
    int mSpecialGraveStoneX;                    // 431
    int mSpecialGraveStoneY;                    // 432
    float mFogOffset;                           // 433
    int mOffsetMoved;                           // 434
    ReanimationID mCoverLayerAnimIDs[7];        // 435 ~ 441
    int mFogBlownCountDown;                     // 442
    PlantRowType mPlantRow[6];                  // 443 ~ 448
    int mWaveRowGotLawnMowered[6];              // 449 ~ 454
    int mBonusLawnMowersRemaining;              // 455
    int mIceMinX[6];                            // 456 ~ 461
    int mIceTimer[6];                           // 462 ~ 467
    ParticleSystemID mIceParticleID[6];         // 468 ~ 473
    TodSmoothArray mRowPickingArray[6];         // 474 ~ 497
    ZombieType mZombiesInWave[100][50];         // 498 ~ 5497
    bool mZombieAllowed[100];                   // 5498 ~ 5522
    int mSunCountDown;                          // 5523
    int mNumSunsFallen;                         // 5524
    int mShakeCounter;                          // 5525
    int mShakeAmountX;                          // 5526
    int mShakeAmountY;                          // 5527
    BackgroundType mBackground;                 // 5528
    int mLevel;                                 // 5529
    int mSodPosition;                           // 5530
    int mPrevMouseX;                            // 5531
    int mPrevMouseY;                            // 5532
    int mSunMoney1;                             // 5533
    int mSunMoney2;                             // 5534
    int mDeathMoney;                            // 5535
    int mNumWaves;                              // 5536
    int mMainCounter;                           // 5537
    int mEffectCounter;                         // 5538
    int mDrawCount;                             // 5539
    int mRiseFromGraveCounter;                  // 5540
    int mOutOfMoneyCounter;                     // 5541
    int mCurrentWave;                           // 5542
    int mTotalSpawnedWaves;                     // 5543
    TutorialState mTutorialState;               // 5544
    int *mTutorialParticleID;                   // 5545
    int mTutorialTimer;                         // 5546
    int mLastBungeeWave;                        // 5547
    int mZombieHealthToNextWave;                // 5548
    int mZombieHealthWaveStart;                 // 5549
    int mZombieCountDown;                       // 5550
    int mZombieCountDownStart;                  // 5551
    int mHugeWaveCountDown;                     // 5552
    bool mHelpDisplayed[72];                    // 5553 ~ 5570
    AdviceType mHelpIndex;                      // 5571
    bool mFinalBossKilled;                      // 22288
    bool mShowShovel;                           // 22289
    bool mShowButter;                           // 22290
    bool mShowHammer;                           // 22291
    int mCoinBankFadeCount;                     // 5573
    DebugTextMode mDebugTextMode;               // 5574
    bool mLevelComplete;                        // 22300
    bool mNewWallNutAndSunFlowerAndChomperOnly; // 在对齐间隙插入成员，22301
    char mNewPeaShooterCount;                   // 在对齐间隙插入成员，22302
    int mBoardFadeOutCounter;                   // 5576
    int mNextSurvivalStageCounter;              // 5577
    int mScoreNextMowerCounter;                 // 5578
    bool mLevelAwardSpawned;                    // 22316
    int mProgressMeterWidth;                    // 5580
    int mFlagRaiseCounter;                      // 5581
    int mIceTrapCounter;                        // 5582
    int mBoardRandSeed;                         // 5583
    ParticleSystemID mPoolSparklyParticleID;    // 5584
    Reanimation *mFwooshID[6][12];              // 5585 ~ 5656
    int mFwooshCountDown;                       // 5657
    int mTimeStopCounter;                       // 5658
    bool mDroppedFirstCoin;                     // 22636
    int mFinalWaveSoundCounter;                 // 5660
    int mCobCannonCursorDelayCounter;           // 5661
    int mCobCannonMouseX;                       // 5662
    int mCobCannonMouseY;                       // 5663
    bool mKilledYeti;                           // 22656
    bool mMustacheMode;                         // 22657
    bool mSuperMowerMode;                       // 22658
    bool mFutureMode;                           // 22659
    bool mPinataMode;                           // 22660
    bool mDanceMode;                            // 22661
    bool mDaisyMode;                            // 22662
    bool mSukhbirMode;                          // 22663
    int mPrevBoardResult;                       // 5666
    int mTriggeredLawnMowers;                   // 5667
    int mPlayTimeActiveLevel;                   // 5668
    int mPlayTimeInactiveLevel;                 // 5669
    int mMaxSunPlants;                          // 5670
    int mStartDrawTime;                         // 5671
    int mIntervalDrawTime;                      // 5672
    int mIntervalDrawCountStart;                // 5673
    float mMinFPS;                              // 5674
    int mPreloadTime;                           // 5675
    int mGameID;                                // 5676
    int mGravesCleared;                         // 5677
    int mPlantsEaten;                           // 5678
    int mPlantsShoveled;                        // 5679
    int mCoinsCollected;                        // 5680
    int mDiamondsCollected;                     // 5681
    int mPottedPlantsCollected;                 // 5682
    int mChocolateCollected;                    // 5683
    bool mPeaShooterUsed;                       // 22736
    bool mCatapultPlantsUsed;                   // 22737
    int mCollectedCoinStreak;                   // 5685
    int mUnkIntSecondPlayer1;                   // 5686
    bool mUnkBoolSecondPlayer;                  // 22748
    int mUnkIntSecondPlayer2;                   // 5688
    int *mStringSecondPlayer;                   // 5689
    int unknownMembers[8];                      // 5690 ~ 5697

    Projectile *AddProjectile(int theX, int theY, int theRenderOrder, int theRow, ProjectileType theProjectileType) {
        return reinterpret_cast<Projectile *(*)(Board *, int, int, int, int, ProjectileType)>(Board_AddProjectileAddr)(this, theX, theY, theRenderOrder, theRow, theProjectileType);
    }
    int PixelToGridX(int theX, int theY) { return reinterpret_cast<int (*)(Board *, int, int)>(Board_PixelToGridXAddr)(this, theX, theY); }
    int PixelToGridY(int theX, int theY) { return reinterpret_cast<int (*)(Board *, int, int)>(Board_PixelToGridYAddr)(this, theX, theY); }
    GridItem *GetLadderAt(int theGridX, int theGridY);
    GridItem *GetScaryPotAt(int theGridX, int theGridY);
    GridItem *GetGridItemAt(GridItemType theGridItemType, int theGridX, int theGridY);
